---
aliases:
  - Switches de couche 3
  - Layer 3 switches
---


# 1.1.b+ Switches de couche 3 (Layer 3 switches)

## Introduction
Les commutateurs de couche 3 (Layer 3 switches) combinent les fonctionnalités des commutateurs de couche 2 et des routeurs. Ils fonctionnent à la fois au niveau de la couche liaison de données (couche 2) et de la couche réseau (couche 3) du modèle OSI, permettant ainsi la commutation et le routage des paquets de données.

## Rôle et Fonction des Switches de Couche 3

1. **Commutation et Routage**:
   - Les switches de couche 3 transfèrent des trames de données au sein du même réseau local (comme les switches de couche 2) et routent les paquets entre différents réseaux (comme les routeurs).
   - Ils utilisent à la fois les adresses MAC pour la commutation et les adresses IP pour le routage.

2. **Support des VLANs et Routage Inter-VLAN**:
   - Les switches de couche 3 permettent la création de VLANs pour segmenter un réseau en plusieurs sous-réseaux logiques.
   - Ils peuvent effectuer le routage inter-VLAN, permettant la communication entre différents VLANs sans nécessiter un routeur séparé.

3. **Performance et Scalabilité**:
   - Offrent des capacités de routage élevées avec une faible latence, adaptées aux environnements nécessitant une performance élevée.
   - Scalabilité pour prendre en charge de grands réseaux avec de nombreux VLANs et sous-réseaux.

## Fonctionnalités des Switches de Couche 3

1. **Table de Routage**:
   - Les switches de couche 3 maintiennent une table de routage contenant des informations sur les routes vers différents réseaux.
   - Utilisation de protocoles de routage dynamique comme OSPF et EIGRP pour échanger des informations de routage avec d'autres dispositifs.

2. **Routage Inter-VLAN**:
   - Permet la communication entre différents VLANs en configurant des interfaces VLAN sur le switch.
   - Chaque VLAN peut avoir une adresse IP de passerelle assignée, permettant aux dispositifs dans ce VLAN de communiquer avec d'autres VLANs.

3. **Access Control Lists (ACLs)**:
   - Utilisées pour contrôler le trafic qui traverse le switch, en permettant ou bloquant des paquets en fonction de critères définis (adresses IP, protocoles, ports, etc.).
   - ACLs appliquées aux interfaces pour sécuriser le réseau.

## Configuration de Base d'un Switch de Couche 3

1. **Accès au Switch**:
   - Connexion via console, SSH ou telnet.
   - Utilisation des modes utilisateur et privilégié pour accéder aux commandes de configuration.

2. **Configuration Initiale**:
   - Définir le nom de l'hôte :
     ```plaintext
     Switch> enable
     Switch# configure terminal
     Switch(config)# hostname S3
     ```

3. **Configuration des Interfaces VLAN**:
   - Création d'interfaces VLAN et assignation d'adresses IP :
     ```plaintext
     S3(config)# interface vlan 10
     S3(config-if)# ip address 192.168.10.1 255.255.255.0
     S3(config-if)# no shutdown
     S3(config-if)# exit
     S3(config)# interface vlan 20
     S3(config-if)# ip address 192.168.20.1 255.255.255.0
     S3(config-if)# no shutdown
     S3(config-if)# exit
     ```

4. **Configuration des Ports**:
   - Assignation des ports aux VLANs :
     ```plaintext
     S3(config)# interface FastEthernet0/1
     S3(config-if)# switchport mode access
     S3(config-if)# switchport access vlan 10
     S3(config-if)# exit
     S3(config)# interface FastEthernet0/2
     S3(config-if)# switchport mode access
     S3(config-if)# switchport access vlan 20
     S3(config-if)# exit
     ```

5. **Configuration de Routage Inter-VLAN**:
   - Activation du routage IP sur le switch :
     ```plaintext
     S3(config)# ip routing
     ```

6. **Configuration de Routes Statique**:
   - Définition de routes statiques pour les réseaux externes :
     ```plaintext
     S3(config)# ip route 0.0.0.0 0.0.0.0 192.168.1.1
     ```

## Sécurisation et Gestion du Switch

1. **Configuration des Mots de Passe**:
   - Configuration du mot de passe pour l'accès privilégié :
     ```plaintext
     S3(config)# enable secret MySecurePassword
     ```
   - Configuration du mot de passe pour la console :
     ```plaintext
     S3(config)# line console 0
     S3(config-line)# password MyConsolePassword
     S3(config-line)# login
     S3(config-line)# exit
     ```
   - Configuration du mot de passe pour Telnet/SSH :
     ```plaintext
     S3(config)# line vty 0 4
     S3(config-line)# password MyVTYPassword
     S3(config-line)# login
     S3(config-line)# exit
     ```

2. **Configuration du Message de Bannière**:
   - Affichage d'un message d'avertissement lors de la connexion :
     ```plaintext
     S3(config)# banner motd #
     Enter TEXT message. End with the character '#'.
     Unauthorized access is prohibited!
     #
     ```

3. **Sauvegarde de la Configuration**:
   - Enregistrer la configuration courante dans la mémoire non volatile :
     ```plaintext
     S3# write memory
     ```
   - Alternative : Utiliser la commande `copy` :
     ```plaintext
     S3# copy running-config startup-config
     ```

## Vérification de la Configuration

1. **Vérifier l'état des Interfaces**:
   - Affichage des interfaces et de leur état :
     ```plaintext
     S3# show ip interface brief
     ```

2. **Vérifier les Routes configurées**:
   - Affichage des routes dans la table de routage :
     ```plaintext
     S3# show ip route
     ```

3. **Vérifier la Configuration en Cours**:
   - Affichage de la configuration courante :
     ```plaintext
     S3# show running-config
     ```

## Exemple Complet de Configuration

Voici un exemple complet de configuration de base d'un switch de couche 3 :

```plaintext
Switch> enable
Switch# configure terminal
Switch(config)# hostname S3
S3(config)# enable secret MySecurePassword
S3(config)# line console 0
S3(config-line)# password MyConsolePassword
S3(config-line)# login
S3(config-line)# exit
S3(config)# line vty 0 4
S3(config-line)# password MyVTYPassword
S3(config-line)# login
S3(config-line)# exit
S3(config)# banner motd #
Enter TEXT message. End with the character '#'.
Unauthorized access is prohibited!
#
S3(config)# interface vlan 10
S3(config-if)# ip address 192.168.10.1 255.255.255.0
S3(config-if)# no shutdown
S3(config-if)# exit
S3(config)# interface vlan 20
S3(config-if)# ip address 192.168.20.1 255.255.255.0
S3(config-if)# no shutdown
S3(config-if)# exit
S3(config)# interface FastEthernet0/1
S3(config-if)# switchport mode access
S3(config-if)# switchport access vlan 10
S3(config-if)# exit
S3(config)# interface FastEthernet0/2
S3(config-if)# switchport mode access
S3(config-if)# switchport access vlan 20
S3(config-if)# exit
S3(config)# ip routing
S3(config)# ip route 0.0.0.0 0.0.0.0 192.168.1.1
S3(config)# end
S3# write memory
```

## Conclusion

Les switches de couche 3 jouent un rôle crucial dans les réseaux modernes, combinant les capacités de commutation de couche 2 et les fonctionnalités de routage de couche 3. La maîtrise de la configuration de base de ces commutateurs est essentielle pour réussir l'examen CCNA et pour gérer efficacement les réseaux Cisco.
