D'accord, voici une note détaillée sur [[2.1 Configuration de base du routeur]] centrée sur Cisco IOS :

---

# Configuration de base du routeur

## Accès au Routeur

1. **Connexion Physique**:
   - **Console** : Utilisation d'un câble console pour une connexion directe. Souvent utilisée pour la configuration initiale.
   - **SSH/Telnet** : Connexion à distance une fois que le routeur est configuré avec une adresse IP.

2. **Modes de Commande**:
   - **Mode Utilisateur** : Accès de base, avec des commandes limitées (`Router>`).
   - **Mode Privilégié** : Accès aux commandes de diagnostic et de gestion (`Router#`). Utiliser `enable` pour y accéder.
   - **Mode de Configuration Globale** : Accès aux commandes de configuration (`Router(config)#`). Utiliser `configure terminal` pour y accéder.

## Configuration Initiale

1. **Configuration du Nom d’Hôte**:
   - Définir un nom pour identifier le routeur.
   ```plaintext
   Router> enable
   Router# configure terminal
   Router(config)# hostname R1
   ```

2. **Configuration des Interfaces**:
   - Assigner des adresses IP aux interfaces et les activer.
   ```plaintext
   R1(config)# interface GigabitEthernet0/0
   R1(config-if)# ip address 192.168.1.1 255.255.255.0
   R1(config-if)# no shutdown
   R1(config-if)# exit
   ```

3. **Configuration d’une Route Statique**:
   - Définir une route pour permettre la communication avec d'autres réseaux.
   ```plaintext
   R1(config)# ip route 0.0.0.0 0.0.0.0 192.168.1.254
   ```

## Sécurisation de l'Accès

1. **Configuration des Mots de Passe**:
   - Mot de passe pour le mode privilégié.
   ```plaintext
   R1(config)# enable secret MySecurePassword
   ```
   - Mot de passe pour la console.
   ```plaintext
   R1(config)# line console 0
   R1(config-line)# password MyConsolePassword
   R1(config-line)# login
   R1(config-line)# exit
   ```
   - Mot de passe pour Telnet/SSH.
   ```plaintext
   R1(config)# line vty 0 4
   R1(config-line)# password MyVTYPassword
   R1(config-line)# login
   R1(config-line)# exit
   ```

2. **Configuration du Message de Bannière**:
   - Affichage d'un message d'avertissement lors de la connexion.
   ```plaintext
   R1(config)# banner motd #
   Enter TEXT message. End with the character '#'.
   Unauthorized access is prohibited!
   #
   ```

## Sauvegarde de la Configuration

1. **Enregistrer la Configuration**:
   - Sauvegarder la configuration courante dans la mémoire non volatile.
   ```plaintext
   R1# write memory
   ```
   - Alternative: Utiliser la commande `copy`.
   ```plaintext
   R1# copy running-config startup-config
   ```

## Vérification de la Configuration

1. **Vérifier l'état des interfaces**:
   ```plaintext
   R1# show ip interface brief
   ```

2. **Vérifier les routes configurées**:
   ```plaintext
   R1# show ip route
   ```

3. **Vérifier la configuration en cours**:
   ```plaintext
   R1# show running-config
   ```

## Exemple Complet de Configuration

Voici un exemple complet de configuration de base d'un routeur Cisco :

```plaintext
Router> enable
Router# configure terminal
Router(config)# hostname R1
R1(config)# enable secret MySecurePassword
R1(config)# line console 0
R1(config-line)# password MyConsolePassword
R1(config-line)# login
R1(config-line)# exit
R1(config)# line vty 0 4
R1(config-line)# password MyVTYPassword
R1(config-line)# login
R1(config-line)# exit
R1(config)# banner motd #
Enter TEXT message. End with the character '#'.
Unauthorized access is prohibited!
#
R1(config)# interface GigabitEthernet0/0
R1(config-if)# ip address 192.168.1.1 255.255.255.0
R1(config-if)# no shutdown
R1(config-if)# exit
R1(config)# ip route 0.0.0.0 0.0.0.0 192.168.1.254
R1(config)# end
R1# write memory
```
